Revit 2027 API
SpecTypeId.ElectricalFrequency Property
 Frequency, in discipline Electrical.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ElectricalFrequency { get; }
Public Shared ReadOnly Property ElectricalFrequency As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ElectricalFrequency {
	ForgeTypeId^ get ();
}
static member ElectricalFrequency : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace